########################################################################################################################
###                                        排课算法数据文件                                                          ###
########################################################################################################################
#                                    项目名称：基于贪心和邻域搜索算法的排课算法                               #
#                                    程 序 员：张 鑫                                                          #
#                                    开始日期：2020年5月26日                                                  #
#                                    更新日期：2020年6月17日[1],2020年6月30日[2]                              #
# ---------------------------------------------------------------------------------------------------------------------#
# 变量：
#       WEEK                       :: 一周排课的天数
#       SECTION                    :: 一天排课节数
#       LINK_COURSE_COUNT_PEER_DAY :: 一天连堂课最多节数
#       COURSE_TOTAL               :: 不同班级下课程对应的总课时数
#       COURSE_LINKED_HOURS        :: 不同班级下课程对应的连堂课课时数
#       COURSE_MORNING_TOTAL       :: 不同班级下课程对应的最大上午排课课时数
#       TEACHER_HEAD_TAIL_NUM      :: 某教师下午首节和末节安排的最大课时数,0表示不限制  格式: {教师:(上午首节最大课时数,上午末节课最大课时数,下午首节最大课时数,下午末节课最大课时数)} [2]
#       COURSE_SAME_TIME_NUM       :: 设置某门课最多可几个班同时上课（教室容量限制）    格式: 科目:最多几个班同时上课
#       CLASSES                    :: 班级列表，按顺序列数所有的班级
#       CLASSES_COURSE_TEACHER     :: 不同班级下课程对应的教师名称
#       CONFLICT_TEACHERS          :: 教师互斥信息，规定不能同一时间上课的教师，2人一组
#       EXTRA_ASSIGN_COURSE        :: 额外需要安排的课程
#       BIND_CLASSES               :: 对开课程
#       FLOW_CLASS_TIME            :: 走班课时间
#       NOT_ASSIGN_TIME            :: 不排课时间
#       NOT_ASSIGN_TEACHER         :: 固定教师不排课的时间
#       NOT_ASSIGN_COURSE          :: 固定科目不排课的时间
#       PART_SCHEDULE              :: 手排课时间，可提前手动安排课程
#       LINK_COURSE_TIMES          :: 连堂课可排时间(day -- 天数,section -- 节数)
########################################################################################################################
# 默认的规则(须知）:
# 1. 同一科目，一天只能排一节，可以是单独一节课（1课时），也可以是一节连堂课（2课时）
# 2. 同一科目的连排不能相邻
# 3. 一天8个课时，其中上午4课时，下午4课时
# 合理性检测规则:
# 1.总课时数不超过一周最大课时数
# 2.科目手排课+连堂课课时数不超过科目总课时数 + 手排课没有重复位置
# 3.连排课课时数数不超过总课时数
# 4.科目一周排课节数 <= 5 (包括连堂课，因为同科目一天不能排两次）另外: 如果通过增加连堂课节数能修正用户操作，则增加连堂课节数
# 5.COURSE_TOTAL COURSE_LINKED_HOURS COURSE_MORNING_TOTAL 置空需保留班级和科目
# 6.每个班连堂课总数<LINK_COURSE_COUNT_PEER_DAY*5 否则无法安排完所有的连堂课
########################################################################################################################
WEEK = 5
SECTION = 8
LINK_COURSE_COUNT_PEER_DAY = 1
COURSE_TOTAL = {
    '1班': {'语': 7, '数': 5, '英': 5, '物': 4, '化': 5, '政': 5, '体': 3, '音-美': 1, '班': 1},
    '2班': {'语':8, '数': 8, '英': 3, '物': 3, '生': 3, '政': 3, '体': 4, '音-美': 4, '班': 4},
    '3班': {'语': 2, '数': 3, '英': 2, '物': 3, '化': 4, '政': 2, '体': 3, '音-美': 1, '班': 1},
    '4班': {'语': 5, '数': 6, '英': 5, '物': 2, '化': 4, '生': 4, '政': 4, '体': 3, '音-美': 1, '班': 1},
    '5班': {'语': 5, '数': 6, '英': 5, '物': 4, '化': 4, '政': 4, '体': 3, '音-美': 1, '班': 1},
    '6班': {'语': 5, '数': 6, '英': 5, '物': 4, '化': 4, '政': 5, '体': 3, '音-美': 1, '班': 1},
    '7班': {'语': 5, '数': 6, '英': 5, '物': 2, '政': 4, '地': 4, '体': 3, '音-美': 1, '班': 1},
    '8班': {'语': 5, '数': 6, '英': 5, '物': 2, '历': 4, '政': 4, '地': 4, '体': 3, '音-美': 1, '班': 1},
    '9班': {'语': 5, '数': 6, '英': 5, '物': 2, '历': 4, '政': 4, '体': 3, '音-美': 1, '班': 1}
}

COURSE_LINKED_HOURS = {
    '1班': {'语': 1, '数': 1, '英': 1, '物': 1, '化': 1, '生': 1, '历': 1, '政': 1, '地': 1, '体': 0, '音-美': 0, '班': 0},
    '2班': {'语': 1, '数': 1, '英': 1, '物': 1, '化': 1, '生': 1, '历': 1, '政': 1, '地': 1, '体': 0, '音-美': 0, '班': 0},
    '3班': {'语': 1, '数': 1, '英': 1, '物': 1, '化': 1, '生': 1, '历': 1, '政': 1, '地': 1, '体': 0, '音-美': 0, '班': 0},
    '4班': {'语': 1, '数': 1, '英': 1, '物': 1, '化': 1, '生': 1, '历': 1, '政': 1, '地': 1, '体': 0, '音-美': 0, '班': 0},
    '5班': {'语': 1, '数': 1, '英': 1, '物': 1, '化': 1, '生': 1, '历': 1, '政': 1, '地': 1, '体': 0, '音-美': 0, '班': 0},
    '6班': {'语': 1, '数': 1, '英': 1, '物': 1, '化': 1, '生': 1, '历': 1, '政': 1, '地': 1, '体': 0, '音-美': 0, '班': 0},
    '7班': {'语': 1, '数': 1, '英': 1, '物': 1, '化': 1, '生': 1, '历': 1, '政': 1, '地': 1, '体': 0, '音-美': 0, '班': 0},
    '8班': {'语': 1, '数': 1, '英': 1, '物': 1, '化': 1, '生': 1, '历': 1, '政': 1, '地': 1, '体': 0, '音-美': 0, '班': 0},
    '9班': {'语': 1, '数': 1, '英': 1, '物': 1, '化': 1, '生': 1, '历': 1, '政': 1, '地': 1, '体': 0, '音-美': 0, '班': 0}
}
COURSE_MORNING_TOTAL = {
    '1班': {'语': 6, '数': 6, '英': 5, '物': 4, '化': 4, '生': 4, '历': 4, '政': 4, '地': 4, '体': 3, '音-美': 1, '班': 1},
    '2班': {'语': 5, '数': 6, '英': 5, '物': 4, '化': 4, '生': 4, '历': 4, '政': 4, '地': 4, '体': 3, '音-美': 1, '班': 1},
    '3班': {'语': 5, '数': 6, '英': 5, '物': 4, '化': 4, '生': 4, '历': 4, '政': 4, '地': 4, '体': 3, '音-美': 1, '班': 1},
    '4班': {'语': 5, '数': 6, '英': 5, '物': 4, '化': 4, '生': 4, '历': 4, '政': 4, '地': 4, '体': 3, '音-美': 1, '班': 1},
    '5班': {'语': 5, '数': 6, '英': 5, '物': 4, '化': 4, '生': 4, '历': 4, '政': 4, '地': 4, '体': 3, '音-美': 1, '班': 1},
    '6班': {'语': 5, '数': 6, '英': 5, '物': 4, '化': 4, '生': 4, '历': 4, '政': 4, '地': 4, '体': 3, '音-美': 1, '班': 1},
    '7班': {'语': 5, '数': 6, '英': 5, '物': 4, '化': 4, '生': 4, '历': 4, '政': 4, '地': 4, '体': 3, '音-美': 1, '班': 1},
    '8班': {'语': 5, '数': 6, '英': 5, '物': 4, '化': 4, '生': 4, '历': 4, '政': 4, '地': 4, '体': 3, '音-美': 1, '班': 1},
    '9班': {'语': 5, '数': 6, '英': 5, '物': 4, '化': 4, '生': 4, '历': 4, '政': 4, '地': 4, '体': 3, '音-美': 1, '班': 1}
}
TEACHER_HEAD_TAIL_NUM = {'teacher1': (0, 0, 0, 0)}
COURSE_SAME_TIME_NUM = {'course1': 4}
CLASSES = ['1班', '2班', '3班', '4班', '5班', '6班', '7班', '8班', '9班']
CLASSES_COURSE_TEACHER = {
    '1班': {'语': '毕姗', '数': '曹宇', '英': '路平', '物': '王碧雪', '化': '刘臣', '音-美': '王祎', '班': '刘臣', '体': '体-1', '政': '许鑫'},
    '2班': {'语': '杨青', '数': '高金华', '英': '骆晓梦', '物': '齐伟华', '生': '王丹', '音-美': '王祎', '班': '王丹', '体': '体-1', '政': '许鑫'},
    '3班': {'语': '何映', '数': '高金华', '英': '骆晓梦', '物': '徐金宝', '化': '谭湘湘', '音-美': '王祎', '班': '徐金宝', '体': '体-1', '政': '许鑫'},
    '4班': {'语': '毕姗', '数': '季琳琳', '英': '孙敏嘉', '化': '谭湘湘', '生': '王丹', '音-美': '王祎', '班': '谭湘湘', '体': '体-1', '政': '韩志红',
           '物': '齐伟华'},
    '5班': {'语': '于安琪', '数': '白彩芳', '英': '孙敏嘉', '物': '齐伟华', '化': '刘臣', '音-美': '王祎', '班': '孙敏嘉', '体': '体-1', '政': '韩志红'},
    '6班': {'语': '吉茹颖', '数': '齐雪然', '英': '张文阁', '物': '徐金宝', '化': '王晓捷', '音-美': '王祎', '班': '齐雪然', '体': '体-2', '政': '韩志红'},
    '7班': {'语': '何映', '数': '季琳琳', '英': '德永红', '地': '雷志清', '政': '刘婕', '音-美': '王祎', '班': '何映', '体': '体-2', '物': '齐伟华'},
    '8班': {'语': '于安琪', '数': '白彩芳', '英': '德永红', '历': '黄艳', '地': '刘壮壮', '音-美': '王祎', '班': '白彩芳', '体': '体-2', '政': '刘婕',
           '物': '徐金宝'},
    '9班': {'语': '杨青', '数': '曹宇', '英': '路平', '历': '黄艳', '政': '刘婕', '音-美': '王祎', '班': '路平', '体': '体-2', '物': '王碧雪'}
}
CONFLICT_TEACHERS = {'教师1-教师2': [{'week': 4, 'section': 5},{'week': 5, 'section': 8}]}
# GO_TEACHERS = ['王碧雪', '王晓捷', '王丹', '于秀艳', '黄艳', '雷志清', '刘壮壮', '许鑫']
EXTRA_ASSIGN_COURSE = {
    '1班': [{'course': '政', 'num': 2, 'teacher': '许鑫'}],
    '2班': [{'course': '政', 'num': 2, 'teacher': '许鑫'}],
    '3班': [{'course': '政', 'num': 2, 'teacher': '许鑫'}],
    '4班': [{'course': '政', 'num': 2, 'teacher': '韩志红'}, {'course': '物', 'num': 2, 'teacher': '齐伟华'}],
    '5班': [{'course': '政', 'num': 2, 'teacher': '韩志红'}],
    '6班': [{'course': '政', 'num': 2, 'teacher': '韩志红'}],
    '7班': [{'course': '物', 'num': 2, 'teacher': '齐伟华'}],
    '8班': [{'course': '政', 'num': 2, 'teacher': '刘婕'}, {'course': '物', 'num': 2, 'teacher': '徐金宝'}],
    '9班': [{'course': '物', 'num': 2, 'teacher': '王碧雪'}]
}
BIND_CLASSES = {'1班-化': {'class': '2班', 'subject': '生'}, '9班-政': {'class': '7班', 'subject': '地'}}
FLOW_CLASS_TIME = [
    {'week': 2, 'section': 5},
    {'week': 4, 'section': 5},
    {'week': 5, 'section': 5},
    {'week': 3, 'section': 3},
]
NOT_ASSIGN_TIME = [
    {'week': 1, 'section': 8},
    {'week': 2, 'section': 8},
]
NOT_ASSIGN_TEACHER = {
    # demo
    # '杨静': [{'week': 1, 'section': 7}, {'week': 2, 'section': 7}, {'week': 3, 'section': 7}, {'week': 5, 'section': 7}]
}
NOT_ASSIGN_COURSE = {
    '语': [{'week': 4, 'section': 5}, {'week': 4, 'section': 6}, {'week': 4, 'section': 7}, {'week': 4, 'section': 8},
          {'week': 3, 'section': 2}],
    '数': [{'week': 4, 'section': 1}, {'week': 4, 'section': 2}, {'week': 4, 'section': 3}, {'week': 4, 'section': 4},
          {'week': 2, 'section': 5},
          {'week': 1, 'section': 5}, {'week': 1, 'section': 6}, {'week': 1, 'section': 7}, {'week': 1, 'section': 8},
          {'week': 2, 'section': 6}, {'week': 2, 'section': 7}, {'week': 2, 'section': 8},
          # {'week': 4, 'section': 5}, {'week': 4, 'section': 6}, {'week': 4, 'section': 7}, {'week': 4, 'section': 8},
          {'week': 5, 'section': 5}, {'week': 5, 'section': 6}, {'week': 5, 'section': 7}, {'week': 5, 'section': 8}],
    '英': [{'week': 3, 'section': 1}, {'week': 3, 'section': 2}, {'week': 3, 'section': 3}, {'week': 3, 'section': 4},
          {'week': 2, 'section': 6}, {'week': 2, 'section': 7}],
    '物': [{'week': 3, 'section': 5}, {'week': 3, 'section': 6}, {'week': 3, 'section': 7}, {'week': 3, 'section': 8},
          {'week': 5, 'section': 4}],
    '化': [{'week': 3, 'section': 5}, {'week': 3, 'section': 6}, {'week': 3, 'section': 7}, {'week': 3, 'section': 8},
          {'week': 5, 'section': 2}],
    '生': [{'week': 3, 'section': 5}, {'week': 3, 'section': 6}, {'week': 3, 'section': 7}, {'week': 3, 'section': 8},
          {'week': 1, 'section': 1}],
    '历': [{'week': 3, 'section': 5}, {'week': 3, 'section': 6}, {'week': 3, 'section': 7}, {'week': 3, 'section': 8},
          {'week': 1, 'section': 1}],
    '政': [{'week': 3, 'section': 5}, {'week': 3, 'section': 6}, {'week': 3, 'section': 7}, {'week': 3, 'section': 8},
          {'week': 5, 'section': 1}],
    '地': [{'week': 3, 'section': 5}, {'week': 3, 'section': 6}, {'week': 3, 'section': 7}, {'week': 3, 'section': 8},
          {'week': 1, 'section': 1}],
    '体': [{'week': 4, 'section': 5}, {'week': 4, 'section': 6}, {'week': 4, 'section': 7}, {'week': 4, 'section': 8}],
    '音-美': [{'week': 2, 'section': 3}],
    '班': [],
}
PART_SCHEDULE = [
    # 手排课-demo
    {'week': 2, 'section': 6, 'class': '1班', 'course': '体'},
    {'week': 2, 'section': 6, 'class': '2班', 'course': '体'},
    {'week': 2, 'section': 6, 'class': '3班', 'course': '体'},
    {'week': 2, 'section': 6, 'class': '4班', 'course': '体'},
    {'week': 2, 'section': 6, 'class': '5班', 'course': '体'},

    {'week': 2, 'section': 7, 'class': '6班', 'course': '体'},
    {'week': 2, 'section': 7, 'class': '7班', 'course': '体'},
    {'week': 2, 'section': 7, 'class': '8班', 'course': '体'},
    {'week': 2, 'section': 7, 'class': '9班', 'course': '体'},

    {'week': 4, 'section': 8, 'class': '1班', 'course': '体'},
    {'week': 4, 'section': 8, 'class': '2班', 'course': '体'},
    {'week': 4, 'section': 8, 'class': '3班', 'course': '体'},
    {'week': 4, 'section': 8, 'class': '4班', 'course': '体'},
    {'week': 4, 'section': 8, 'class': '5班', 'course': '体'},
    {'week': 4, 'section': 8, 'class': '6班', 'course': '体'},
    {'week': 4, 'section': 8, 'class': '7班', 'course': '体'},
    {'week': 4, 'section': 8, 'class': '8班', 'course': '体'},
    {'week': 4, 'section': 8, 'class': '9班', 'course': '体'},

    {'week': 5, 'section': 3, 'class': '1班', 'course': '体'},
    {'week': 5, 'section': 3, 'class': '2班', 'course': '体'},
    {'week': 5, 'section': 3, 'class': '3班', 'course': '体'},
    {'week': 5, 'section': 3, 'class': '4班', 'course': '体'},
    {'week': 5, 'section': 3, 'class': '5班', 'course': '体'},

    {'week': 5, 'section': 4, 'class': '6班', 'course': '体'},
    {'week': 5, 'section': 4, 'class': '7班', 'course': '体'},
    {'week': 5, 'section': 4, 'class': '8班', 'course': '体'},
    {'week': 5, 'section': 4, 'class': '9班', 'course': '体'},
]
LINK_COURSE_TIMES = [
    {'week': 1, 'section': 1},
    # {'week': 1, 'section': 2},
    {'week': 1, 'section': 3},
    {'week': 1, 'section': 5},
    {'week': 1, 'section': 6},
    {'week': 1, 'section': 7},
    # {'week': 1, 'section': 8},
    {'week': 2, 'section': 1},
    # {'week': 2, 'section': 2},
    {'week': 2, 'section': 3},
    {'week': 2, 'section': 5},
    {'week': 2, 'section': 6},
    {'week': 2, 'section': 7},
    # {'week': 2, 'section': 8},
    {'week': 3, 'section': 1},
    # {'week': 3, 'section': 2},
    {'week': 3, 'section': 3},
    {'week': 3, 'section': 5},
    {'week': 3, 'section': 6},
    {'week': 3, 'section': 7},
    # {'week': 3, 'section': 8},
    {'week': 4, 'section': 1},
    # {'week': 4, 'section': 2},
    {'week': 4, 'section': 3},
    {'week': 4, 'section': 5},
    {'week': 4, 'section': 6},
    {'week': 4, 'section': 7},
    # {'week': 4, 'section': 8},
    {'week': 5, 'section': 1},
    # {'week': 5, 'section': 2},
    {'week': 5, 'section': 3},
    {'week': 5, 'section': 5},
    {'week': 5, 'section': 6},
    {'week': 5, 'section': 7},
    # {'week': 5, 'section': 8},
]